package com.iroda.practice.GuliTest;

public class Test2 {
   // есть 2 переменные A и B, поменять местами значения без использования 3 переменной...

    public static void main(String[] args) {
        int a = 15;
        int b = 30;

        System.out.println("До замены: a = " + a + ", b = " + b);

        a = a + b; // Сложение значений a и b, результат записываем в переменную a
        b = a - b; // Вычитание значения b из нового значения a, результат записываем в переменную b
        a = a - b; // Вычитание значения b из нового значения a, результат записываем в переменную a

        System.out.println("После замены: a = " + a + ", b = " + b);
    }
}




